{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "displayName": "CE-L2-Android-CORP-Configuration",
  "description": "Cyber Essentials L2 hardened baseline for corporate-owned Android Enterprise devices (fully managed / COBO / COPE). Builds on L1 by strengthening password complexity, blocking developer features and USB/external media, and tightening work/personal data separation.",
  "version": 1,
  "passwordRequiredType": "alphanumeric",
  "passwordMinimumLength": 10,
  "passwordMinimumLetterCharacters": 1,
  "passwordMinimumLowerCaseCharacters": 1,
  "passwordMinimumNonLetterCharacters": 1,
  "passwordMinimumNumericCharacters": 1,
  "passwordMinimumSymbolCharacters": 1,
  "passwordMinimumUpperCaseCharacters": 1,
  "passwordMinutesOfInactivityBeforeScreenTimeout": 3,
  "passwordPreviousPasswordCountToBlock": 5,
  "passwordSignInFailureCountBeforeFactoryReset": 8,
  "appsAllowInstallFromUnknownSources": false,
  "personalProfileAppsAllowInstallFromUnknownSources": false,
  "securityRequireVerifyApps": true,
  "securityDeveloperSettingsEnabled": false,
  "storageAllowUsb": false,
  "storageBlockExternalMedia": true,
  "storageBlockUsbFileTransfer": true,
  "bluetoothBlockContactSharing": true,
  "crossProfilePoliciesAllowCopyPaste": false,
  "crossProfilePoliciesAllowDataSharing": "dataSharingFromWorkToPersonalBlocked",
  "personalProfileCameraBlocked": false,
  "personalProfileScreenCaptureBlocked": false,
  "screenCaptureBlocked": true
}
