{
  "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "displayName": "CE-L2-Android-BYOD-Configuration",
  "description": "Cyber Essentials L2 hardened baseline for Android Enterprise work profile (BYOD). Builds on L1 by enforcing a stronger work profile password, tighter lock/inactivity behaviour and stricter data separation between work and personal profiles.",
  "version": 1,
  "workProfileRequirePassword": true,
  "workProfilePasswordRequiredType": "atLeastAlphanumeric",
  "workProfilePasswordMinimumLength": 8,
  "workProfilePasswordMinNumericCharacters": 1,
  "workProfilePasswordMinLetterCharacters": 1,
  "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": 3,
  "workProfilePasswordPreviousPasswordBlockCount": 5,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": 5,
  "workProfileDataSharingType": "preventAny",
  "workProfileBlockCrossProfileCopyPaste": true,
  "workProfileBlockCrossProfileContactsSearch": true,
  "workProfileBlockScreenCapture": true,
  "workProfileBluetoothEnableContactSharing": false,
  "securityRequireVerifyApps": true
}
