{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
  "displayName": "Android-CORP-L2-Compliance-Baseline-2025-04",
  "description": "Cyber Essentials L1 baseline \u2013 Android corp-owned fully managed / corp-owned work profile.",
  "roleScopeTagIds": [
    "0"
  ],
  "scheduledActionsForRule": [
    {
      "ruleName": "SimpleDeviceCompliance",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "secured",
  "advancedThreatProtectionRequiredSecurityLevel": "secured",
  "securityBlockJailbrokenDevices": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "securityRequiredAndroidSafetyNetEvaluationType": "hardwareBacked",
  "securityRequireIntuneAppIntegrity": true,
  "osMinimumVersion": "14",
  "minAndroidSecurityPatchLevel": "2025-04-01",
  "requireNoPendingSystemUpdates": true,
  "passwordRequired": true,
  "passwordMinimumLength": 8,
  "passwordMinimumLetterCharacters": 1,
  "passwordMinimumNumericCharacters": 1,
  "passwordRequiredType": "alphanumeric",
  "passwordMinutesOfInactivityBeforeLock": 3,
  "passwordExpirationDays": 180,
  "passwordPreviousPasswordCountToBlock": 5,
  "storageRequireEncryption": true
}