{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
  "displayName": "Android-CORP-L2-Configuration-Baseline-2025-04",
  "description": "Cyber Essentials L1 baseline \u2013 Android corp-owned fully managed / corp-owned work profile.",
  "accountsBlockModification": true,
  "appsAllowInstallFromUnknownSources": false,
  "appsAutoUpdatePolicy": "always",
  "appsDefaultPermissionPolicy": "autoDeny",
  "crossProfilePoliciesAllowCopyPaste": false,
  "crossProfilePoliciesAllowDataSharing": "dataSharingFromWorkToPersonalBlocked",
  "crossProfilePoliciesShowWorkContactsInPersonalProfile": false,
  "bluetoothBlockContactSharing": true,
  "passwordRequiredType": "alphanumeric",
  "passwordMinimumLength": 8,
  "passwordExpirationDays": 365,
  "passwordMinutesOfInactivityBeforeScreenTimeout": 3,
  "passwordPreviousPasswordCountToBlock": 5,
  "securityDeveloperSettingsEnabled": false,
  "screenCaptureBlocked": true,
  "statusBarBlocked": false,
  "storageAllowUsb": false,
  "storageBlockExternalMedia": true,
  "storageBlockUsbFileTransfer": true,
  "systemUpdateInstallType": "automatic",
  "wifiBlockEditConfigurations": true,
  "wifiBlockEditPolicyDefinedConfigurations": true,
  "personalProfileAppsAllowInstallFromUnknownSources": false,
  "securityRequireVerifyApps": true
}