{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
  "displayName": "CE-L2 Android CORP – Compliance",
  "description": "Cyber Essentials L2 hardened baseline for corporate-owned Android Enterprise devices (fully managed / COBO / COPE). Builds on L1 by enforcing a stronger device password, shorter idle timeout, device and advanced threat protection, and strict OS/security patch baselines.",
  "version": 1,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "low",
  "advancedThreatProtectionRequiredSecurityLevel": "secured",
  "securityBlockJailbrokenDevices": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "osMinimumVersion": "10.0",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": "2024-04-01",
  "passwordRequired": true,
  "passwordMinimumLength": 10,
  "passwordMinimumLetterCharacters": 1,
  "passwordMinimumLowerCaseCharacters": 1,
  "passwordMinimumNonLetterCharacters": 1,
  "passwordMinimumNumericCharacters": 1,
  "passwordMinimumSymbolCharacters": 1,
  "passwordMinimumUpperCaseCharacters": 1,
  "passwordRequiredType": "alphanumeric",
  "passwordMinutesOfInactivityBeforeLock": 3,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordCountToBlock": 5,
  "storageRequireEncryption": true,
  "securityRequireIntuneAppIntegrity": true,
  "requireNoPendingSystemUpdates": true,
  "securityRequiredAndroidSafetyNetEvaluationType": "hardwareBacked",
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
