{
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "displayName": "CE-L2 Android BYOD – Compliance",
  "description": "Cyber Essentials L2 hardened baseline for Android Enterprise work profile (BYOD). Builds on L1 by enforcing stronger device PIN, shorter idle timeout, disabling USB debugging, enabling device threat protection and enforcing minimum OS/security patch levels.",
  "version": 1,
  "passwordRequired": true,
  "passwordMinimumLength": 8,
  "passwordRequiredType": "alphanumeric",
  "passwordMinutesOfInactivityBeforeLock": 3,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordBlockCount": 5,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": true,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "low",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": "10.0",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": "2024-04-01",
  "storageRequireEncryption": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
