{
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "displayName": "CE-L1 CA-04 – Admins require MFA and compliant device",
  "description": "Cyber Essentials L1 baseline. Requires multifactor authentication and a compliant device for all sign-ins by privileged users in the specified admin group, for all cloud apps.",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "None"
      ],
      "excludeUsers": [],
      "includeGroups": [
        "OBJECTID-ADMINS-GROUP"
      ],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "insiderRiskLevels": [],
    "authenticationFlows": null,
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "operator": "AND",
    "builtInControls": [
      "mfa",
      "compliantDevice"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength": null
  }
}
