{
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "displayName": "CE-L1 CA-02 – Require MFA for all users",
  "description": "Cyber Essentials L1 baseline. Requires multifactor authentication for all users accessing any cloud app, excluding designated break-glass accounts.",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [
        "OBJECTID-BREAKGLASS-1",
        "OBJECTID-BREAKGLASS-2"
      ],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "insiderRiskLevels": [],
    "authenticationFlows": null,
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength": null
  }
}
