{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "displayName": "CE-L2 iOS CORP – Compliance",
  "description": "Cyber Essentials L2 (hardened) baseline for corporate-owned/supervised iOS/iPadOS devices. Builds on CE L1 with longer, more complex passcodes, tighter inactivity timeouts, a higher minimum OS and mandatory mobile threat defence.",
  "version": 1,
  "roleScopeTagIds": [],
  "passcodeRequired": true,
  "passcodeBlockSimple": true,
  "passcodeMinimumLength": 10,
  "passcodeRequiredType": "alphanumeric",
  "passcodeMinimumCharacterSetCount": 3,
  "passcodePreviousPasscodeBlockCount": 10,
  "passcodeMinutesOfInactivityBeforeLock": 2,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": 2,
  "osMinimumVersion": "17.0",
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "low",
  "managedEmailProfileRequired": true,
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "actionType": "block",
          "gracePeriodHours": 0
        }
      ]
    }
  ]
}
