{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "displayName": "CE-L2 iOS BYOD – Compliance",
  "description": "Cyber Essentials L2 (hardened) baseline for personally-owned iOS/iPadOS devices accessing organisational data. Builds on CE L1 by requiring stronger device unlock, minimum OS version and mobile threat defence.",
  "version": 1,
  "roleScopeTagIds": [],
  "passcodeRequired": true,
  "passcodeBlockSimple": true,
  "passcodeMinimumLength": 8,
  "passcodeRequiredType": "alphanumeric",
  "passcodeMinimumCharacterSetCount": 2,
  "passcodePreviousPasscodeBlockCount": 5,
  "passcodeMinutesOfInactivityBeforeLock": 3,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": 3,
  "osMinimumVersion": "16.0",
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "low",
  "managedEmailProfileRequired": false,
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "actionType": "block",
          "gracePeriodHours": 0
        }
      ]
    }
  ]
}
