{
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "displayName": "CE-L1 Android BYOD – Compliance",
  "description": "Cyber Essentials L1 baseline for Android Enterprise work profile (BYOD). Enforces device lock, minimum PIN length, encryption and Google Play Protect / Play Integrity checks aligned to CE v3.2 secure configuration and malware protection controls.",
  "version": 1,
  "passwordRequired": true,
  "passwordMinimumLength": 6,
  "passwordRequiredType": "numeric",
  "passwordMinutesOfInactivityBeforeLock": 5,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordBlockCount": 5,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": false,
  "securityRequireVerifyApps": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "storageRequireEncryption": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
