{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
  "displayName": "CE-L1 Android CORP – Compliance",
  "description": "Cyber Essentials L1 baseline for Android Enterprise fully managed / corporate-owned devices. Enforces strong device PIN, encryption, Play Integrity checks and no pending OS/security updates aligned to CE v3.2 secure configuration, malware protection and secure update management controls.",
  "version": 1,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "passwordRequired": true,
  "passwordMinimumLength": 8,
  "passwordRequiredType": "alphanumeric",
  "passwordMinutesOfInactivityBeforeLock": 5,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordCountToBlock": 5,
  "storageRequireEncryption": true,
  "securityRequireIntuneAppIntegrity": true,
  "requireNoPendingSystemUpdates": true,
  "securityRequiredAndroidSafetyNetEvaluationType": "basic",
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
