{
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "displayName": "Android-BYOD-L1-Compliance-Baseline-2025-04",
  "description": "Cyber Essentials L1 baseline \u2013 Android personally-owned work profile.",
  "roleScopeTagIds": [
    "0"
  ],
  "scheduledActionsForRule": [
    {
      "ruleName": "SimpleDeviceCompliance",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "passwordRequired": true,
  "passwordMinimumLength": 6,
  "passwordRequiredType": "alphanumeric",
  "passwordMinutesOfInactivityBeforeLock": 5,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordBlockCount": 5,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": true,
  "securityBlockJailbrokenDevices": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": false,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "osMinimumVersion": "14",
  "minAndroidSecurityPatchLevel": "2025-01-01",
  "storageRequireEncryption": true
}