{
  "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "displayName": "CE-L1-Android-BYOD-Configuration",
  "description": "Cyber Essentials L1 baseline for Android Enterprise work profile (BYOD). Enforces a PIN for the work profile, limits failed attempts, and requires Google Play Protect 'Verify apps'. Maps primarily to CE controls: 2. Secure configuration, 4. User access control, 5. Malware protection (v3.2, April 2025).",
  "version": 1,
  "workProfileRequirePassword": true,
  "workProfilePasswordRequiredType": "atLeastNumeric",
  "workProfilePasswordMinimumLength": 6,
  "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": 5,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": 10,
  "securityRequireVerifyApps": true
}
