{
  "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "displayName": "CE-L1-Android-CORP-Configuration",
  "description": "Cyber Essentials L1 baseline for corporate-owned Android Enterprise devices (fully managed / COPE). Enforces a device PIN policy, limits failed attempts, requires Google Play Protect 'Verify apps', and blocks installation from unknown sources. Maps primarily to CE controls: 2. Secure configuration, 4. User access control, 5. Malware protection (v3.2, April 2025).",
  "version": 1,
  "passwordRequiredType": "numericComplex",
  "passwordMinimumLength": 6,
  "passwordSignInFailureCountBeforeFactoryReset": 10,
  "securityRequireVerifyApps": true,
  "appsAllowInstallFromUnknownSources": false
}
