{
  "@odata.type": "#microsoft.graph.macOSGeneralDeviceConfiguration",
  "displayName": "CE-L2 - macOS General (Corporate)",
  "description": "Cyber Essentials L2 baseline for macOS general settings (stronger password, tighter timeouts) for corporate-owned devices.",
  "passwordRequired": true,
  "passwordBlockSimple": true,
  "passwordRequiredType": "alphanumeric",
  "passwordMinimumLength": 12,
  "passwordMinutesOfInactivityBeforeScreenTimeout": 2,
  "passwordMinutesOfInactivityBeforeLock": 5
}
