{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "displayName": "CE-L2 Windows 11 CORP – Compliance",
  "description": "Cyber Essentials L2 hardened baseline for corporate Windows 11 devices. Builds on CE-L1 by increasing password strength, shortening idle lock and enforcing a minimum Windows 11 build via Device Health Attestation settings.",
  "version": 1,
  "passwordRequired": true,
  "passwordBlockSimple": true,
  "passwordRequiredToUnlockFromIdle": true,
  "passwordMinutesOfInactivityBeforeLock": 5,
  "passwordExpirationDays": 365,
  "passwordMinimumLength": 14,
  "passwordMinimumCharacterSetCount": 3,
  "passwordRequiredType": "alphanumeric",
  "passwordPreviousPasswordBlockCount": 5,
  "requireHealthyDeviceReport": true,
  "osMinimumVersion": "10.0.22000.0",
  "earlyLaunchAntiMalwareDriverEnabled": true,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "storageRequireEncryption": true,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
