{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "displayName": "CE-L1 iOS BYOD – Compliance",
  "description": "Cyber Essentials L1 baseline for iOS / iPadOS BYOD. Enforces device passcode, basic complexity, inactivity lock and jailbreak detection aligned to CE v3.2 secure configuration and malware protection controls.",
  "version": 1,
  "passcodeRequired": true,
  "passcodeBlockSimple": true,
  "passcodeMinimumLength": 6,
  "passcodeRequiredType": "numeric",
  "passcodeMinutesOfInactivityBeforeLock": 5,
  "passcodePreviousPasscodeBlockCount": 5,
  "passcodeMinimumCharacterSetCount": 1,
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
