{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "displayName": "CE-L1 iOS CORP – Compliance",
  "description": "Cyber Essentials L1 baseline for supervised / corporate-owned iOS / iPadOS devices. Enforces strong alphanumeric passcodes, short inactivity lock, jailbreak detection and managed email alignment with CE v3.2 secure configuration, user access control and malware protection controls.",
  "version": 1,
  "passcodeRequired": true,
  "passcodeBlockSimple": true,
  "passcodeMinimumLength": 8,
  "passcodeRequiredType": "alphanumeric",
  "passcodeMinutesOfInactivityBeforeLock": 5,
  "passcodePreviousPasscodeBlockCount": 5,
  "passcodeMinimumCharacterSetCount": 2,
  "osMinimumVersion": "16.0",
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": true,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
