{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "displayName": "CE-L1 Windows 10/11 CORP – Compliance",
  "description": "Cyber Essentials L1 baseline for corporate Windows 10/11 devices. Enforces password policy, encryption, secure boot and Device Health Attestation to align with CE v3.2 secure configuration, malware protection and secure update management controls.",
  "version": 1,
  "passwordRequired": true,
  "passwordBlockSimple": true,
  "passwordRequiredToUnlockFromIdle": true,
  "passwordMinutesOfInactivityBeforeLock": 10,
  "passwordExpirationDays": 365,
  "passwordMinimumLength": 12,
  "passwordMinimumCharacterSetCount": 2,
  "passwordRequiredType": "alphanumeric",
  "passwordPreviousPasswordBlockCount": 5,
  "requireHealthyDeviceReport": true,
  "earlyLaunchAntiMalwareDriverEnabled": true,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "storageRequireEncryption": true,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
